<!DOCTYPE HTML>
<html lang="es">
<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <link rel="stylesheet" href="style.css" title="Color">
  <title>Biografias  </title>
</head>
<h1 align="center" id="luis1">Biografia Alan Turing</h1>
<h2 align="center" >(1912-1954)</h2>
<center><img  src="AlanT.jpg" width="200" height="250"></center>

<br>
<p>
 Alan Mathison Turing (Paddington, Londres; 23 de junio de 1912-Wilmslow, Cheshire; 7 de junio de 1954) fue un matem&aacute;tico, l&oacute;gico, inform&aacute;tico te&oacute;rico, cript&oacute;grafo, fil&oacute;sofo y bi&oacute;logo te&oacute;rico brit&aacute;nico.</p>
 <P>
 Es considerado como uno de los padres de la ciencia de la computaci&oacute;n y precursor de la inform&aacute;tica moderna. Proporcion&oacute; una formalizaci&oacute;n influyente de los conceptos de algoritmo y computaci&oacute;n: la m&aacute;quina de Turing. Formul&oacute; su propia versi&oacute;n que hoy es ampliamente aceptada como la tesis de Church-Turing (1936) entre muchas otras de sus <a href="#aportaciones">aportaciones</a>.</P>

 <h2>Indice</h2>
<ul>
  <li><a href="#Pa">Primeros años</a></li>
  <li><a href="#Estudios">Estudios</a></li>
  <li><a href="#a">Ultimos años</a></li>
  <li><a href="#aportaciones">Aportaciones</a></li>
</ul>
 <h2 id="Pa">Primeros años</h2>
 <p>
 Por razones de trabajo, la familia resid&iacute;a en la India brit&aacute;nica. Sin embargo, tanto Julius como Ethel quer&iacute;an que sus hijos se criaran en Gran Bretaña, por lo que se mudaron a Maida Vale (Londres). All&iacute; naci&oacute; Alan Turing el 23 de junio de 1912. Turing tuvo un hermano mayor.

Durante su infancia, sus padres viajaron constantemente entre Hastings, Reino Unido, y la India debido a que su padre segu&iacute;a activo en la Administraci&oacute;n Colonial, por lo que pasó algunos años viviendo con su hermano en la casa de un matrimonio retirado del ej&eacute;rcito.

Muy pronto Turing mostr&oacute; signos del genio que luego ser&iacute;a. Desde temprana edad mostr&oacute; un gran inter&eacute;s por la lectura, por los n&uacute;meros y los rompecabezas.
</p>
<img src="GB.jpg" width="350" height="300">             
<img src="MT.jpg" width="350" height="300">
<h2 id="Estudios">Estudios</h2>
<p>
Entre enero de 1922 y 1926, Turing estudi&oacute; en la preparatoria Hazelhurst, una escuela independiente en el pueblo de Frant en Sussex (hoy East Oriental).

En 1926, con trece años, ingres&oacute; en el internado de Sherborne, en Dorset. Su primer d&iacute;a de clase coincidi&oacute; con la huelga general en Inglaterra, pero su determinaci&oacute;n por asistir a clase era tan firme que recorri&oacute; con su bicicleta los m&aacute;s de 96 km que separaban Southampton de su escuela, pasando la noche en una posada.

La inclinación natural de Turing hacia la matem&aacute;tica y la ciencia no le atrajo el respeto de sus profesores de Sherborne, cuyo concepto de educaci&oacute;n hac&iacute;a mayor &eacute;nfasis en los cl&aacute;sicos. En la escuela de Sherbone, gan&oacute; la mayor parte de los premios matem&aacute;ticos que se otorgaban y, adem&aacute;s, realizaba experimentos qu&iacute;micos por su cuenta, aunque la opini&oacute;n del profesorado respecto a la independencia y ambici&oacute;n de Turing no era demasiado favorable. A pesar de ello, el joven continu&oacute; mostrando una singular habilidad para los estudios que realmente le gustaban, y lleg&oacute; a resolver problemas muy avanzados para su edad (16 años) sin ni siquiera haber estudiado c&aacute;lculo elemental.
</p>

<h2 id="a">Ultimos años</h2>
<p>
  La carrera de Turing termin&oacute; s&uacute;bitamente tras ser procesado por homosexualidad en 1952. Dos años despu&eacute;s de su condena, muri&oacute; seg&uacute;n la versi&oacute;n oficial por suicidio; sin embargo, su muerte ha dado lugar a otras hip&oacute;tesis, incluida la del envenenamiento accidental . Después de una campaña p&uacute;blica en 2009, el primer ministro brit&aacute;nico, Gordon Brown, se disculp&oacute; p&uacute;blicamente en nombre del gobierno brit&aacute;nico por «la forma espantosa en la que Turing había sido tratado». La reina Isabel II le otorg&oacute; un indulto p&oacute;stumo en 2013. El t&eacute;rmino «ley Alan Turing» ahora se usa de manera informal para referirse a una ley de 2017 en el Reino Unido que perdona retroactivamente a hombres amonestados o condenados en virtud de la legislación que prohib&iacute;a los actos homosexuales.

Turing tiene un extenso legado con estatuas y muchas cosas que llevan su nombre, incluido un premio anual por innovaci&oacute;n en inform&aacute;tica. Aparece en el billete actual de 50 libras del Banco de Inglaterra, que se lanz&oacute; el 23 de junio de 2021, coincidiendo con su cumpleaños. Un programa de la BBC de 2019, votado por la audiencia, lo nombró la persona más grande del siglo XX.
</p>

<h2 id="aportaciones">Aportaciones más significativas</h2>
<ul>
  <li>M&aacute;quina de Turing</li>
  <li>M&aacute;quina oracle</li>
  <li>Prueba de Turing</li>
  <li>M&aacute;quina enigma</li>

</ul>
<H2 id="luis2">Fuentes<br><h5 id="luis3">Si buscas informaci&oacute;n m&aacute;s detallada te invitados a dar click <a href="https://es.wikipedia.org/wiki/Alan_Turing">aqu&iacute;</a></h5></H2>

</HTML>
